---
kind: type
id: T:Autodesk.Revit.DB.Analysis.AnalysisDisplayMarkersAndTextSettings
source: html/bb940def-7483-32c6-01cb-1c79e6666290.htm
---
# Autodesk.Revit.DB.Analysis.AnalysisDisplayMarkersAndTextSettings

Contains markers and text settings for analysis display style element.

## Syntax (C#)
```csharp
public class AnalysisDisplayMarkersAndTextSettings : IDisposable
```